Repository: SparkleNetworks/Be2BillNet
Catalog: src/NET40.Be2BillNet/Resources/Strings.*.resx
Languages: fr

# Config_ApiIdentifier_Description
source: Corresponds to the IDENTIFIER parameter.
fr: Correspond au paramètre IDENTIFIER.

# Config_ApiIdentifier_Name
source: API username
fr: Identifiant du compte

# Config_ApiKey_Description
source: Used to sign requests.
fr: Permet de signer les requètes.

# Config_ApiKey_Name
source: API password
fr: Mot de passe personnel

# Config_PaymentSubmitUrl_Description
source: The URL to post forms at. Something like https://xxxxxxxx.be2bill.com/front/form/process.php
fr: L'adresse à laquelle soumettre les formulaires de paiment. Quelque chose comme https://xxxxxxxx.be2bill.com/front/form/process.php

# Config_PaymentSubmitUrl_Name
source: Payment form URL
fr: URL des formulaires de paiement

# Config_PaymentSubmitUrl_Regex1
source: Must start with "https://"
fr: Doit commencer par "https://"

# Config_RestUrl_Description
source: The URL for server-to-server requests. Something like https://xxxxxxxx.be2bill.com/front/service/rest/process
fr: L'adresse à laquelle soumettre les requêtes server-à-serveur. Quelque chose comme https://xxxxxxxx.be2bill.com/front/service/rest/process

# Config_RestUrl_Name
source: REST URL
fr: URL des requètes REST

# Config_RestUrl_Regex1
source: Must start with "https://"
fr: Doit commencer par "https://"

# ExecCode_0000_Name
source: Successful operation
fr: Opération réussie

# ExecCode_0001_Name
source: 3D Secure authentication required
fr: Identification 3DSecure requise

# ExecCode_0002_Name
source: Redirection to an alternative means of payment required
fr: Redirection vers un moyen de paiement alternatif requis

# ExecCode_1001_Name
source: Missing parameter
fr: Paramètre manquant

# ExecCode_1002_Name
source: Invalid parameter
fr: Paramètre invalide

# ExecCode_1003_Name
source: HASH error
fr: Erreur HASH

# ExecCode_1004_Name
source: Insupported protocol
fr: Protocole non supporté

# ExecCode_1005_Name
source: REST error
fr: Erreur REST

# ExecCode_2001_Name
source: ALIAS not found
fr: Alias non trouvé

# ExecCode_2002_Name
source: Reference transaction not found
fr: Transaction de référence non trouvée

# ExecCode_2003_Name
source: Reference transaction not completed
fr: Transaction de référence non aboutie

# ExecCode_2004_Name
source: Reference transaction not refundable
fr: Transaction de référence non remboursable

# ExecCode_2005_Name
source: Reference authorization not caputrable
fr: Autorisation de référence non capturable

# ExecCode_2006_Name
source: Reference transaction not finished
fr: Transaction de référence non terminée

# ExecCode_2007_Name
source: Invalid capture amount
fr: Montant de capture invalide

# ExecCode_2008_Name
source: Invalid refund amount
fr: Montant de remboursement invalide

# ExecCode_2009_Name
source: Expired authorization
fr: Autorisation expirée

# ExecCode_2010_Name
source: Instalment schedule not found
fr: échéancier non trouvé

# ExecCode_2011_Name
source: Instalment schedule already interrupted
fr: échéancier déjà interrompu

# ExecCode_2012_Name
source: Instalment schedule already finished
fr: échéancier déjà terminé

# ExecCode_3001_Name
source: Disabled account
fr: Compte désactivé

# ExecCode_3002_Name
source: Unauthorized server IP address
fr: Adresse IP serveur non autorisée

# ExecCode_3003_Name
source: Unauthorized transaction
fr: Transaction non permise

# ExecCode_4001_Name
source: Transaction declined by the banking network
fr: Transaction refusée par le réseau bancaire

# ExecCode_4002_Name
source: Insufficient funds
fr: Fonds insuffisants

# ExecCode_4003_Name
source: Card declined by the banking network
fr: Carte refusée par le réseau bancaire

# ExecCode_4004_Name
source: Aborted transaction
fr: Transaction abandonnée

# ExecCode_4005_Name
source: Fraud suspicion
fr: Suspicion de fraude

# ExecCode_4006_Name
source: Lost card
fr: Carte perdue

# ExecCode_4007_Name
source: Stolen Card
fr: Carte volée

# ExecCode_4008_Name
source: 3DSecure authentication failed
fr: Authentification 3DSecure échouée

# ExecCode_4009_Name
source: 3DSecure authentication expired
fr: Authentification 3DSecure expirée

# ExecCode_4010_Name
source: Invalid transaction
fr: Transaction invalide

# ExecCode_4011_Name
source: Duplicated transaction
fr: Transaction doublon

# ExecCode_4012_Name
source: Invalid card data
fr: Données de carte invalides

# ExecCode_4013_Name
source: Transaction declined by banking network for this holder
fr: Transaction non autorisée par le réseau bancaire pour ce porteur

# ExecCode_5001_Name
source: Exchange protocol failure
fr: Erreur protocole d'échange

# ExecCode_5002_Name
source: Banking network error
fr: Erreur réseau bancaire

# ExecCode_5004_Name
source: Time out, the response will be sent to the notification URL
fr: Délai dépassé, la réponse arrivera par URL de notification

# ExecCode_5005_Name
source: 3D Secure module display error
fr: Erreur d'affichage du module 3D Secure

# ExecCode_6001_Name
source: Transaction declined by the merchant
fr: Transaction refusée par le marchand

# ExecCode_6002_Name
source: Transaction declined
fr: Transaction refusée

# ExecCode_6003_Name
source: The cardholder has already disputed a transaction
fr: Le porteur a déjà contesté une transaction

# ExecCode_6004_Name
source: Transaction declined by merchant rules
fr: Transaction refusée par les règles du marchand
